OpenFOAM_Artery_Lab_ADT/openfoam9/tutorials/heatTransfer/chtMultiRegionFoam/reverseBurner/constant/gas/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ignition
{
    type            heatSource;

    selectionMode   cellSet;
    cellSet         ignition;

    q
    {
        type        scale;
        scale       squarePulse;
        start       0;
        duration    1;
        value       5e7;
    }
}

radiation
{
    type    radiation;
    libs    ("libradiationModels.so");
}

// ************************************************************************* //
